joristork/robots/jobot_in_c/microchip_extras/h/p18f43k22.h
extern volatile near unsigned char       RC1REG;
extern volatile near union {
  struct {
    unsigned RC1REG:8;
  };
  struct {
    unsigned RCREG:8;
  };
} RC1REGbits;
extern volatile near unsigned char       RCREG;
extern volatile near union {
  struct {
    unsigned RC1REG:8;
  };
  struct {
    unsigned RCREG:8;
  };
} RCREGbits;
extern volatile near unsigned char       RCREG1;
extern volatile near union {
  struct {
    unsigned RC1REG:8;
  };
  struct {
    unsigned RCREG:8;
  };
} RCREG1bits;
extern volatile near unsigned char       SP1BRG;
extern volatile near union {
  struct {
    unsigned SP1BRG:8;
  };
  struct {
    unsigned SPBRG:8;
  };
} SP1BRGbits;
extern volatile near unsigned char       SPBRG;
extern volatile near union {
  struct {
    unsigned SP1BRG:8;
  };
  struct {
    unsigned SPBRG:8;
  };
} SPBRGbits;
extern volatile near unsigned char       SPBRG1;
extern volatile near union {
  struct {
    unsigned SP1BRG:8;
  };
  struct {
    unsigned SPBRG:8;
  };
} SPBRG1bits;
extern volatile near unsigned char       SP1BRGH;
extern volatile near union {
  struct {
    unsigned SP1BRGH:8;
  };
  struct {
    unsigned SPBRGH:8;
  };
} SP1BRGHbits;
extern volatile near unsigned char       SPBRGH;
extern volatile near union {
  struct {
    unsigned SP1BRGH:8;
  };
  struct {
    unsigned SPBRGH:8;
  };
} SPBRGHbits;
extern volatile near unsigned char       SPBRGH1;
extern volatile near union {
  struct {
    unsigned SP1BRGH:8;
  };
  struct {
    unsigned SPBRGH:8;
  };
} SPBRGH1bits;
extern volatile near unsigned char       T3CON;
extern volatile near union {
  struct {
    unsigned TMR3ON:1;
    unsigned T3RD16:1;
    unsigned NOT_T3SYNC:1;
    unsigned T3SOSCEN:1;
    unsigned T3CKPS:2;
    unsigned TMR3CS:2;
  };
  struct {
    unsigned :3;
    unsigned T3OSCEN:1;
    unsigned T3CKPS0:1;
    unsigned T3CKPS1:1;
    unsigned TMR3CS0:1;
    unsigned TMR3CS1:1;
  };
} T3CONbits;
extern volatile near unsigned char       TMR3L;
extern volatile near unsigned char       TMR3H;
extern volatile near unsigned char       T3GCON;
extern volatile near union {
  struct {
    unsigned T3GSS:2;
    unsigned T3GVAL:1;
    unsigned T3GGO_NOT_DONE:1;
    unsigned T3GSPM:1;
    unsigned T3GTM:1;
    unsigned T3GPOL:1;
    unsigned TMR3GE:1;
  };
  struct {
    unsigned T3GSS0:1;
    unsigned T3GSS1:1;
    unsigned :1;
    unsigned T3G_DONE:1;
  };
  struct {
    unsigned :3;
    unsigned T3GGO:1;
  };
} T3GCONbits;
extern volatile near unsigned char       ECCP1AS;
extern volatile near union {
  struct {
    unsigned P1SSBD:2;
    unsigned P1SSAC:2;
    unsigned CCP1AS:3;
    unsigned CCP1ASE:1;
  };
  struct {
    unsigned P1SSBD0:1;
    unsigned P1SSBD1:1;
    unsigned P1SSAC0:1;
    unsigned P1SSAC1:1;
    unsigned CCP1AS0:1;
    unsigned CCP1AS1:1;
    unsigned CCP1AS2:1;
  };
  struct {
    unsigned PSS1BD:2;
    unsigned PSS1AC:2;
  };
  struct {
    unsigned PSS1BD0:1;
    unsigned PSS1BD1:1;
    unsigned PSS1AC0:1;
    unsigned PSS1AC1:1;
  };
  struct {
    unsigned PSSBD:2;
    unsigned PSSAC:2;
    unsigned ECCPAS:3;
    unsigned ECCPASE:1;
  };
  struct {
    unsigned PSSBD0:1;
    unsigned PSSBD1:1;
    unsigned PSSAC0:1;
    unsigned PSSAC1:1;
    unsigned ECCPAS0:1;
    unsigned ECCPAS1:1;
    unsigned ECCPAS2:1;
  };
} ECCP1ASbits;
extern volatile near unsigned char       ECCPAS;
extern volatile near union {
  struct {
    unsigned P1SSBD:2;
    unsigned P1SSAC:2;
    unsigned CCP1AS:3;
    unsigned CCP1ASE:1;
  };
  struct {
    unsigned P1SSBD0:1;
    unsigned P1SSBD1:1;
    unsigned P1SSAC0:1;
    unsigned P1SSAC1:1;
    unsigned CCP1AS0:1;
    unsigned CCP1AS1:1;
    unsigned CCP1AS2:1;
  };
  struct {
    unsigned PSS1BD:2;
    unsigned PSS1AC:2;
  };
  struct {
    unsigned PSS1BD0:1;
    unsigned PSS1BD1:1;
    unsigned PSS1AC0:1;
    unsigned PSS1AC1:1;
  };
  struct {
    unsigned PSSBD:2;
    unsigned PSSAC:2;
    unsigned ECCPAS:3;
    unsigned ECCPASE:1;
  };
  struct {
    unsigned PSSBD0:1;
    unsigned PSSBD1:1;
    unsigned PSSAC0:1;
    unsigned PSSAC1:1;
    unsigned ECCPAS0:1;
    unsigned ECCPAS1:1;
    unsigned ECCPAS2:1;
  };
} ECCPASbits;
extern volatile near unsigned char       PWM1CON;
extern volatile near union {
  struct {
    unsigned P1DC:7;
    unsigned P1RSEN:1;
  };
  struct {
    unsigned P1DC0:1;
    unsigned P1DC1:1;
    unsigned P1DC2:1;
    unsigned P1DC3:1;
    unsigned P1DC4:1;
    unsigned P1DC5:1;
    unsigned P1DC6:1;
  };
  struct {
    unsigned PDC:7;
    unsigned PRSEN:1;
  };
  struct {
    unsigned PDC0:1;
    unsigned PDC1:1;
    unsigned PDC2:1;
    unsigned PDC3:1;
    unsigned PDC4:1;
    unsigned PDC5:1;
    unsigned PDC6:1;
  };
} PWM1CONbits;
extern volatile near unsigned char       PWMCON;
extern volatile near union {
  struct {
    unsigned P1DC:7;
    unsigned P1RSEN:1;
  };
  struct {
    unsigned P1DC0:1;
    unsigned P1DC1:1;
    unsigned P1DC2:1;
    unsigned P1DC3:1;
    unsigned P1DC4:1;
    unsigned P1DC5:1;
    unsigned P1DC6:1;
  };
  struct {
    unsigned PDC:7;
    unsigned PRSEN:1;
  };
  struct {
    unsigned PDC0:1;
    unsigned PDC1:1;
    unsigned PDC2:1;
    unsigned PDC3:1;
    unsigned PDC4:1;
    unsigned PDC5:1;
    unsigned PDC6:1;
  };
} PWMCONbits;
extern volatile near unsigned char       BAUD1CON;
extern volatile near union {
  struct {
    unsigned ABDEN:1;
    unsigned WUE:1;
    unsigned :1;
    unsigned BRG16:1;
    unsigned CKTXP:1;
    unsigned DTRXP:1;
    unsigned RCIDL:1;
    unsigned ABDOVF:1;
  };
  struct {
    unsigned :4;
    unsigned SCKP:1;
  };
} BAUD1CONbits;
extern volatile near unsigned char       BAUDCON;
extern volatile near union {
  struct {
    unsigned ABDEN:1;
    unsigned WUE:1;
    unsigned :1;
    unsigned BRG16:1;
    unsigned CKTXP:1;
    unsigned DTRXP:1;
    unsigned RCIDL:1;
    unsigned ABDOVF:1;
  };
  struct {
    unsigned :4;
    unsigned SCKP:1;
  };
} BAUDCONbits;
